GopalSaraf/Practicals/PSDL/include/proc/pic16f1783.inc
// Register: PSMC1PHH
#define PSMC1PHH PSMC1PHH
PSMC1PHH                                 equ 0822h
// bitfield definitions
PSMC1PHH_PSMC1PH8_POSN                   equ 0000h
PSMC1PHH_PSMC1PH8_POSITION               equ 0000h
PSMC1PHH_PSMC1PH8_SIZE                   equ 0001h
PSMC1PHH_PSMC1PH8_LENGTH                 equ 0001h
PSMC1PHH_PSMC1PH8_MASK                   equ 0001h
PSMC1PHH_PSMC1PH9_POSN                   equ 0001h
PSMC1PHH_PSMC1PH9_POSITION               equ 0001h
PSMC1PHH_PSMC1PH9_SIZE                   equ 0001h
PSMC1PHH_PSMC1PH9_LENGTH                 equ 0001h
PSMC1PHH_PSMC1PH9_MASK                   equ 0002h
PSMC1PHH_PSMC1PH10_POSN                  equ 0002h
PSMC1PHH_PSMC1PH10_POSITION              equ 0002h
PSMC1PHH_PSMC1PH10_SIZE                  equ 0001h
PSMC1PHH_PSMC1PH10_LENGTH                equ 0001h
PSMC1PHH_PSMC1PH10_MASK                  equ 0004h
PSMC1PHH_PSMC1PH11_POSN                  equ 0003h
PSMC1PHH_PSMC1PH11_POSITION              equ 0003h
PSMC1PHH_PSMC1PH11_SIZE                  equ 0001h
PSMC1PHH_PSMC1PH11_LENGTH                equ 0001h
PSMC1PHH_PSMC1PH11_MASK                  equ 0008h
PSMC1PHH_PSMC1PH12_POSN                  equ 0004h
PSMC1PHH_PSMC1PH12_POSITION              equ 0004h
PSMC1PHH_PSMC1PH12_SIZE                  equ 0001h
PSMC1PHH_PSMC1PH12_LENGTH                equ 0001h
PSMC1PHH_PSMC1PH12_MASK                  equ 0010h
PSMC1PHH_PSMC1PH13_POSN                  equ 0005h
PSMC1PHH_PSMC1PH13_POSITION              equ 0005h
PSMC1PHH_PSMC1PH13_SIZE                  equ 0001h
PSMC1PHH_PSMC1PH13_LENGTH                equ 0001h
PSMC1PHH_PSMC1PH13_MASK                  equ 0020h
PSMC1PHH_PSMC1PH14_POSN                  equ 0006h
PSMC1PHH_PSMC1PH14_POSITION              equ 0006h
PSMC1PHH_PSMC1PH14_SIZE                  equ 0001h
PSMC1PHH_PSMC1PH14_LENGTH                equ 0001h
PSMC1PHH_PSMC1PH14_MASK                  equ 0040h
PSMC1PHH_PSMC1PH15_POSN                  equ 0007h
PSMC1PHH_PSMC1PH15_POSITION              equ 0007h
PSMC1PHH_PSMC1PH15_SIZE                  equ 0001h
PSMC1PHH_PSMC1PH15_LENGTH                equ 0001h
PSMC1PHH_PSMC1PH15_MASK                  equ 0080h

// Register: PSMC1DCL
#define PSMC1DCL PSMC1DCL
PSMC1DCL                                 equ 0823h
// bitfield definitions
PSMC1DCL_PSMC1DC0_POSN                   equ 0000h
PSMC1DCL_PSMC1DC0_POSITION               equ 0000h
PSMC1DCL_PSMC1DC0_SIZE                   equ 0001h
PSMC1DCL_PSMC1DC0_LENGTH                 equ 0001h
PSMC1DCL_PSMC1DC0_MASK                   equ 0001h
PSMC1DCL_PSMC1DC1_POSN                   equ 0001h
PSMC1DCL_PSMC1DC1_POSITION               equ 0001h
PSMC1DCL_PSMC1DC1_SIZE                   equ 0001h
PSMC1DCL_PSMC1DC1_LENGTH                 equ 0001h
PSMC1DCL_PSMC1DC1_MASK                   equ 0002h
PSMC1DCL_PSMC1DC2_POSN                   equ 0002h
PSMC1DCL_PSMC1DC2_POSITION               equ 0002h
PSMC1DCL_PSMC1DC2_SIZE                   equ 0001h
PSMC1DCL_PSMC1DC2_LENGTH                 equ 0001h
PSMC1DCL_PSMC1DC2_MASK                   equ 0004h
PSMC1DCL_PSMC1DC3_POSN                   equ 0003h
PSMC1DCL_PSMC1DC3_POSITION               equ 0003h
PSMC1DCL_PSMC1DC3_SIZE                   equ 0001h
PSMC1DCL_PSMC1DC3_LENGTH                 equ 0001h
PSMC1DCL_PSMC1DC3_MASK                   equ 0008h
PSMC1DCL_PSMC1DC4_POSN                   equ 0004h
PSMC1DCL_PSMC1DC4_POSITION               equ 0004h
PSMC1DCL_PSMC1DC4_SIZE                   equ 0001h
PSMC1DCL_PSMC1DC4_LENGTH                 equ 0001h
PSMC1DCL_PSMC1DC4_MASK                   equ 0010h
PSMC1DCL_PSMC1DC5_POSN                   equ 0005h
PSMC1DCL_PSMC1DC5_POSITION               equ 0005h
PSMC1DCL_PSMC1DC5_SIZE                   equ 0001h
PSMC1DCL_PSMC1DC5_LENGTH                 equ 0001h
PSMC1DCL_PSMC1DC5_MASK                   equ 0020h
PSMC1DCL_PSMC1DC6_POSN                   equ 0006h
PSMC1DCL_PSMC1DC6_POSITION               equ 0006h
PSMC1DCL_PSMC1DC6_SIZE                   equ 0001h
PSMC1DCL_PSMC1DC6_LENGTH                 equ 0001h
PSMC1DCL_PSMC1DC6_MASK                   equ 0040h
PSMC1DCL_PSMC1DC7_POSN                   equ 0007h
PSMC1DCL_PSMC1DC7_POSITION               equ 0007h
PSMC1DCL_PSMC1DC7_SIZE                   equ 0001h
PSMC1DCL_PSMC1DC7_LENGTH                 equ 0001h
PSMC1DCL_PSMC1DC7_MASK                   equ 0080h

// Register: PSMC1DCH
#define PSMC1DCH PSMC1DCH
PSMC1DCH                                 equ 0824h
// bitfield definitions
PSMC1DCH_PSMC1DC8_POSN                   equ 0000h
PSMC1DCH_PSMC1DC8_POSITION               equ 0000h
PSMC1DCH_PSMC1DC8_SIZE                   equ 0001h
PSMC1DCH_PSMC1DC8_LENGTH                 equ 0001h
PSMC1DCH_PSMC1DC8_MASK                   equ 0001h
PSMC1DCH_PSMC1DC9_POSN                   equ 0001h
PSMC1DCH_PSMC1DC9_POSITION               equ 0001h
PSMC1DCH_PSMC1DC9_SIZE                   equ 0001h
PSMC1DCH_PSMC1DC9_LENGTH                 equ 0001h
PSMC1DCH_PSMC1DC9_MASK                   equ 0002h
PSMC1DCH_PSMC1DC10_POSN                  equ 0002h
PSMC1DCH_PSMC1DC10_POSITION              equ 0002h
PSMC1DCH_PSMC1DC10_SIZE                  equ 0001h
PSMC1DCH_PSMC1DC10_LENGTH                equ 0001h
PSMC1DCH_PSMC1DC10_MASK                  equ 0004h
PSMC1DCH_PSMC1DC11_POSN                  equ 0003h
PSMC1DCH_PSMC1DC11_POSITION              equ 0003h
PSMC1DCH_PSMC1DC11_SIZE                  equ 0001h
PSMC1DCH_PSMC1DC11_LENGTH                equ 0001h
PSMC1DCH_PSMC1DC11_MASK                  equ 0008h
PSMC1DCH_PSMC1DC12_POSN                  equ 0004h
PSMC1DCH_PSMC1DC12_POSITION              equ 0004h
PSMC1DCH_PSMC1DC12_SIZE                  equ 0001h
PSMC1DCH_PSMC1DC12_LENGTH                equ 0001h
PSMC1DCH_PSMC1DC12_MASK                  equ 0010h
PSMC1DCH_PSMC1DC13_POSN                  equ 0005h
PSMC1DCH_PSMC1DC13_POSITION              equ 0005h
PSMC1DCH_PSMC1DC13_SIZE                  equ 0001h
PSMC1DCH_PSMC1DC13_LENGTH                equ 0001h
PSMC1DCH_PSMC1DC13_MASK                  equ 0020h
PSMC1DCH_PSMC1DC14_POSN                  equ 0006h
PSMC1DCH_PSMC1DC14_POSITION              equ 0006h
PSMC1DCH_PSMC1DC14_SIZE                  equ 0001h
PSMC1DCH_PSMC1DC14_LENGTH                equ 0001h
PSMC1DCH_PSMC1DC14_MASK                  equ 0040h
PSMC1DCH_PSMC1DC15_POSN                  equ 0007h
PSMC1DCH_PSMC1DC15_POSITION              equ 0007h
PSMC1DCH_PSMC1DC15_SIZE                  equ 0001h
PSMC1DCH_PSMC1DC15_LENGTH                equ 0001h
PSMC1DCH_PSMC1DC15_MASK                  equ 0080h

// Register: PSMC1PRL
#define PSMC1PRL PSMC1PRL
PSMC1PRL                                 equ 0825h
// bitfield definitions
PSMC1PRL_PSMC1PR0_POSN                   equ 0000h
PSMC1PRL_PSMC1PR0_POSITION               equ 0000h
PSMC1PRL_PSMC1PR0_SIZE                   equ 0001h
PSMC1PRL_PSMC1PR0_LENGTH                 equ 0001h
PSMC1PRL_PSMC1PR0_MASK                   equ 0001h
PSMC1PRL_PSMC1PR1_POSN                   equ 0001h
PSMC1PRL_PSMC1PR1_POSITION               equ 0001h
PSMC1PRL_PSMC1PR1_SIZE                   equ 0001h
PSMC1PRL_PSMC1PR1_LENGTH                 equ 0001h
PSMC1PRL_PSMC1PR1_MASK                   equ 0002h
PSMC1PRL_PSMC1PR2_POSN                   equ 0002h
PSMC1PRL_PSMC1PR2_POSITION               equ 0002h
PSMC1PRL_PSMC1PR2_SIZE                   equ 0001h
PSMC1PRL_PSMC1PR2_LENGTH                 equ 0001h
PSMC1PRL_PSMC1PR2_MASK                   equ 0004h
PSMC1PRL_PSMC1PR3_POSN                   equ 0003h
PSMC1PRL_PSMC1PR3_POSITION               equ 0003h
PSMC1PRL_PSMC1PR3_SIZE                   equ 0001h
PSMC1PRL_PSMC1PR3_LENGTH                 equ 0001h
PSMC1PRL_PSMC1PR3_MASK                   equ 0008h
PSMC1PRL_PSMC1PR4_POSN                   equ 0004h
PSMC1PRL_PSMC1PR4_POSITION               equ 0004h
PSMC1PRL_PSMC1PR4_SIZE                   equ 0001h
PSMC1PRL_PSMC1PR4_LENGTH                 equ 0001h
PSMC1PRL_PSMC1PR4_MASK                   equ 0010h
PSMC1PRL_PSMC1PR5_POSN                   equ 0005h
PSMC1PRL_PSMC1PR5_POSITION               equ 0005h
PSMC1PRL_PSMC1PR5_SIZE                   equ 0001h
PSMC1PRL_PSMC1PR5_LENGTH                 equ 0001h
PSMC1PRL_PSMC1PR5_MASK                   equ 0020h
PSMC1PRL_PSMC1PR6_POSN                   equ 0006h
PSMC1PRL_PSMC1PR6_POSITION               equ 0006h
PSMC1PRL_PSMC1PR6_SIZE                   equ 0001h
PSMC1PRL_PSMC1PR6_LENGTH                 equ 0001h
PSMC1PRL_PSMC1PR6_MASK                   equ 0040h
PSMC1PRL_PSMC1PR7_POSN                   equ 0007h
PSMC1PRL_PSMC1PR7_POSITION               equ 0007h
PSMC1PRL_PSMC1PR7_SIZE                   equ 0001h
PSMC1PRL_PSMC1PR7_LENGTH                 equ 0001h
PSMC1PRL_PSMC1PR7_MASK                   equ 0080h

// Register: PSMC1PRH
#define PSMC1PRH PSMC1PRH
PSMC1PRH                                 equ 0826h
// bitfield definitions
PSMC1PRH_PSMC1PR8_POSN                   equ 0000h
PSMC1PRH_PSMC1PR8_POSITION               equ 0000h
PSMC1PRH_PSMC1PR8_SIZE                   equ 0001h
PSMC1PRH_PSMC1PR8_LENGTH                 equ 0001h
PSMC1PRH_PSMC1PR8_MASK                   equ 0001h
PSMC1PRH_PSMC1PR9_POSN                   equ 0001h
PSMC1PRH_PSMC1PR9_POSITION               equ 0001h
PSMC1PRH_PSMC1PR9_SIZE                   equ 0001h
PSMC1PRH_PSMC1PR9_LENGTH                 equ 0001h
PSMC1PRH_PSMC1PR9_MASK                   equ 0002h
PSMC1PRH_PSMC1PR10_POSN                  equ 0002h
PSMC1PRH_PSMC1PR10_POSITION              equ 0002h
PSMC1PRH_PSMC1PR10_SIZE                  equ 0001h
PSMC1PRH_PSMC1PR10_LENGTH                equ 0001h
PSMC1PRH_PSMC1PR10_MASK                  equ 0004h
PSMC1PRH_PSMC1PR11_POSN                  equ 0003h
PSMC1PRH_PSMC1PR11_POSITION              equ 0003h
PSMC1PRH_PSMC1PR11_SIZE                  equ 0001h
PSMC1PRH_PSMC1PR11_LENGTH                equ 0001h
PSMC1PRH_PSMC1PR11_MASK                  equ 0008h
PSMC1PRH_PSMC1PR12_POSN                  equ 0004h
PSMC1PRH_PSMC1PR12_POSITION              equ 0004h
PSMC1PRH_PSMC1PR12_SIZE                  equ 0001h
PSMC1PRH_PSMC1PR12_LENGTH                equ 0001h
PSMC1PRH_PSMC1PR12_MASK                  equ 0010h
PSMC1PRH_PSMC1PR13_POSN                  equ 0005h
PSMC1PRH_PSMC1PR13_POSITION              equ 0005h
PSMC1PRH_PSMC1PR13_SIZE                  equ 0001h
PSMC1PRH_PSMC1PR13_LENGTH                equ 0001h
PSMC1PRH_PSMC1PR13_MASK                  equ 0020h
PSMC1PRH_PSMC1PR14_POSN                  equ 0006h
PSMC1PRH_PSMC1PR14_POSITION              equ 0006h
PSMC1PRH_PSMC1PR14_SIZE                  equ 0001h
PSMC1PRH_PSMC1PR14_LENGTH                equ 0001h
PSMC1PRH_PSMC1PR14_MASK                  equ 0040h
PSMC1PRH_PSMC1PR15_POSN                  equ 0007h
PSMC1PRH_PSMC1PR15_POSITION              equ 0007h
PSMC1PRH_PSMC1PR15_SIZE                  equ 0001h
PSMC1PRH_PSMC1PR15_LENGTH                equ 0001h
PSMC1PRH_PSMC1PR15_MASK                  equ 0080h

// Register: PSMC1TMRL
#define PSMC1TMRL PSMC1TMRL
PSMC1TMRL                                equ 0827h
// bitfield definitions
PSMC1TMRL_PSMC1TMR0_POSN                 equ 0000h
PSMC1TMRL_PSMC1TMR0_POSITION             equ 0000h
PSMC1TMRL_PSMC1TMR0_SIZE                 equ 0001h
PSMC1TMRL_PSMC1TMR0_LENGTH               equ 0001h
PSMC1TMRL_PSMC1TMR0_MASK                 equ 0001h
PSMC1TMRL_PSMC1TMR1_POSN                 equ 0001h
PSMC1TMRL_PSMC1TMR1_POSITION             equ 0001h
PSMC1TMRL_PSMC1TMR1_SIZE                 equ 0001h
PSMC1TMRL_PSMC1TMR1_LENGTH               equ 0001h
PSMC1TMRL_PSMC1TMR1_MASK                 equ 0002h
PSMC1TMRL_PSMC1TMR2_POSN                 equ 0002h
PSMC1TMRL_PSMC1TMR2_POSITION             equ 0002h
PSMC1TMRL_PSMC1TMR2_SIZE                 equ 0001h
PSMC1TMRL_PSMC1TMR2_LENGTH               equ 0001h
PSMC1TMRL_PSMC1TMR2_MASK                 equ 0004h
PSMC1TMRL_PSMC1TMR3_POSN                 equ 0003h
PSMC1TMRL_PSMC1TMR3_POSITION             equ 0003h
PSMC1TMRL_PSMC1TMR3_SIZE                 equ 0001h
PSMC1TMRL_PSMC1TMR3_LENGTH               equ 0001h
PSMC1TMRL_PSMC1TMR3_MASK                 equ 0008h
PSMC1TMRL_PSMC1TMR4_POSN                 equ 0004h
PSMC1TMRL_PSMC1TMR4_POSITION             equ 0004h
PSMC1TMRL_PSMC1TMR4_SIZE                 equ 0001h
PSMC1TMRL_PSMC1TMR4_LENGTH               equ 0001h
PSMC1TMRL_PSMC1TMR4_MASK                 equ 0010h
PSMC1TMRL_PSMC1TMR5_POSN                 equ 0005h
PSMC1TMRL_PSMC1TMR5_POSITION             equ 0005h
PSMC1TMRL_PSMC1TMR5_SIZE                 equ 0001h
PSMC1TMRL_PSMC1TMR5_LENGTH               equ 0001h
PSMC1TMRL_PSMC1TMR5_MASK                 equ 0020h
PSMC1TMRL_PSMC1TMR6_POSN                 equ 0006h
PSMC1TMRL_PSMC1TMR6_POSITION             equ 0006h
PSMC1TMRL_PSMC1TMR6_SIZE                 equ 0001h
PSMC1TMRL_PSMC1TMR6_LENGTH               equ 0001h
PSMC1TMRL_PSMC1TMR6_MASK                 equ 0040h
PSMC1TMRL_PSMC1TMR7_POSN                 equ 0007h
PSMC1TMRL_PSMC1TMR7_POSITION             equ 0007h
PSMC1TMRL_PSMC1TMR7_SIZE                 equ 0001h
PSMC1TMRL_PSMC1TMR7_LENGTH               equ 0001h
PSMC1TMRL_PSMC1TMR7_MASK                 equ 0080h

// Register: PSMC1TMRH
#define PSMC1TMRH PSMC1TMRH
PSMC1TMRH                                equ 0828h
// bitfield definitions
PSMC1TMRH_PSMC1TMR8_POSN                 equ 0000h
PSMC1TMRH_PSMC1TMR8_POSITION             equ 0000h
PSMC1TMRH_PSMC1TMR8_SIZE                 equ 0001h
PSMC1TMRH_PSMC1TMR8_LENGTH               equ 0001h
PSMC1TMRH_PSMC1TMR8_MASK                 equ 0001h
PSMC1TMRH_PSMC1TMR9_POSN                 equ 0001h
PSMC1TMRH_PSMC1TMR9_POSITION             equ 0001h
PSMC1TMRH_PSMC1TMR9_SIZE                 equ 0001h
PSMC1TMRH_PSMC1TMR9_LENGTH               equ 0001h
PSMC1TMRH_PSMC1TMR9_MASK                 equ 0002h
PSMC1TMRH_PSMC1TMR10_POSN                equ 0002h
PSMC1TMRH_PSMC1TMR10_POSITION            equ 0002h
PSMC1TMRH_PSMC1TMR10_SIZE                equ 0001h
PSMC1TMRH_PSMC1TMR10_LENGTH              equ 0001h
PSMC1TMRH_PSMC1TMR10_MASK                equ 0004h
PSMC1TMRH_PSMC1TMR11_POSN                equ 0003h
PSMC1TMRH_PSMC1TMR11_POSITION            equ 0003h
PSMC1TMRH_PSMC1TMR11_SIZE                equ 0001h
PSMC1TMRH_PSMC1TMR11_LENGTH              equ 0001h
PSMC1TMRH_PSMC1TMR11_MASK                equ 0008h
PSMC1TMRH_PSMC1TMR12_POSN                equ 0004h
PSMC1TMRH_PSMC1TMR12_POSITION            equ 0004h
PSMC1TMRH_PSMC1TMR12_SIZE                equ 0001h
PSMC1TMRH_PSMC1TMR12_LENGTH              equ 0001h
PSMC1TMRH_PSMC1TMR12_MASK                equ 0010h
PSMC1TMRH_PSMC1TMR13_POSN                equ 0005h
PSMC1TMRH_PSMC1TMR13_POSITION            equ 0005h
PSMC1TMRH_PSMC1TMR13_SIZE                equ 0001h
PSMC1TMRH_PSMC1TMR13_LENGTH              equ 0001h
PSMC1TMRH_PSMC1TMR13_MASK                equ 0020h
PSMC1TMRH_PSMC1TMR14_POSN                equ 0006h
PSMC1TMRH_PSMC1TMR14_POSITION            equ 0006h
PSMC1TMRH_PSMC1TMR14_SIZE                equ 0001h
PSMC1TMRH_PSMC1TMR14_LENGTH              equ 0001h
PSMC1TMRH_PSMC1TMR14_MASK                equ 0040h
PSMC1TMRH_PSMC1TMR15_POSN                equ 0007h
PSMC1TMRH_PSMC1TMR15_POSITION            equ 0007h
PSMC1TMRH_PSMC1TMR15_SIZE                equ 0001h
PSMC1TMRH_PSMC1TMR15_LENGTH              equ 0001h
PSMC1TMRH_PSMC1TMR15_MASK                equ 0080h

