GopalSaraf/Practicals/PSDL/include/proc/pic16f1783.inc
// Register: PSMC1DBR
#define PSMC1DBR PSMC1DBR
PSMC1DBR                                 equ 0829h
// bitfield definitions
PSMC1DBR_PSMC1DBR0_POSN                  equ 0000h
PSMC1DBR_PSMC1DBR0_POSITION              equ 0000h
PSMC1DBR_PSMC1DBR0_SIZE                  equ 0001h
PSMC1DBR_PSMC1DBR0_LENGTH                equ 0001h
PSMC1DBR_PSMC1DBR0_MASK                  equ 0001h
PSMC1DBR_PSMC1DBR1_POSN                  equ 0001h
PSMC1DBR_PSMC1DBR1_POSITION              equ 0001h
PSMC1DBR_PSMC1DBR1_SIZE                  equ 0001h
PSMC1DBR_PSMC1DBR1_LENGTH                equ 0001h
PSMC1DBR_PSMC1DBR1_MASK                  equ 0002h
PSMC1DBR_PSMC1DBR2_POSN                  equ 0002h
PSMC1DBR_PSMC1DBR2_POSITION              equ 0002h
PSMC1DBR_PSMC1DBR2_SIZE                  equ 0001h
PSMC1DBR_PSMC1DBR2_LENGTH                equ 0001h
PSMC1DBR_PSMC1DBR2_MASK                  equ 0004h
PSMC1DBR_PSMC1DBR3_POSN                  equ 0003h
PSMC1DBR_PSMC1DBR3_POSITION              equ 0003h
PSMC1DBR_PSMC1DBR3_SIZE                  equ 0001h
PSMC1DBR_PSMC1DBR3_LENGTH                equ 0001h
PSMC1DBR_PSMC1DBR3_MASK                  equ 0008h
PSMC1DBR_PSMC1DBR4_POSN                  equ 0004h
PSMC1DBR_PSMC1DBR4_POSITION              equ 0004h
PSMC1DBR_PSMC1DBR4_SIZE                  equ 0001h
PSMC1DBR_PSMC1DBR4_LENGTH                equ 0001h
PSMC1DBR_PSMC1DBR4_MASK                  equ 0010h
PSMC1DBR_PSMC1DBR5_POSN                  equ 0005h
PSMC1DBR_PSMC1DBR5_POSITION              equ 0005h
PSMC1DBR_PSMC1DBR5_SIZE                  equ 0001h
PSMC1DBR_PSMC1DBR5_LENGTH                equ 0001h
PSMC1DBR_PSMC1DBR5_MASK                  equ 0020h
PSMC1DBR_PSMC1DBR6_POSN                  equ 0006h
PSMC1DBR_PSMC1DBR6_POSITION              equ 0006h
PSMC1DBR_PSMC1DBR6_SIZE                  equ 0001h
PSMC1DBR_PSMC1DBR6_LENGTH                equ 0001h
PSMC1DBR_PSMC1DBR6_MASK                  equ 0040h
PSMC1DBR_PSMC1DBR7_POSN                  equ 0007h
PSMC1DBR_PSMC1DBR7_POSITION              equ 0007h
PSMC1DBR_PSMC1DBR7_SIZE                  equ 0001h
PSMC1DBR_PSMC1DBR7_LENGTH                equ 0001h
PSMC1DBR_PSMC1DBR7_MASK                  equ 0080h

// Register: PSMC1DBF
#define PSMC1DBF PSMC1DBF
PSMC1DBF                                 equ 082Ah
// bitfield definitions
PSMC1DBF_PSMC1DBF0_POSN                  equ 0000h
PSMC1DBF_PSMC1DBF0_POSITION              equ 0000h
PSMC1DBF_PSMC1DBF0_SIZE                  equ 0001h
PSMC1DBF_PSMC1DBF0_LENGTH                equ 0001h
PSMC1DBF_PSMC1DBF0_MASK                  equ 0001h
PSMC1DBF_PSMC1DBF1_POSN                  equ 0001h
PSMC1DBF_PSMC1DBF1_POSITION              equ 0001h
PSMC1DBF_PSMC1DBF1_SIZE                  equ 0001h
PSMC1DBF_PSMC1DBF1_LENGTH                equ 0001h
PSMC1DBF_PSMC1DBF1_MASK                  equ 0002h
PSMC1DBF_PSMC1DBF2_POSN                  equ 0002h
PSMC1DBF_PSMC1DBF2_POSITION              equ 0002h
PSMC1DBF_PSMC1DBF2_SIZE                  equ 0001h
PSMC1DBF_PSMC1DBF2_LENGTH                equ 0001h
PSMC1DBF_PSMC1DBF2_MASK                  equ 0004h
PSMC1DBF_PSMC1DBF3_POSN                  equ 0003h
PSMC1DBF_PSMC1DBF3_POSITION              equ 0003h
PSMC1DBF_PSMC1DBF3_SIZE                  equ 0001h
PSMC1DBF_PSMC1DBF3_LENGTH                equ 0001h
PSMC1DBF_PSMC1DBF3_MASK                  equ 0008h
PSMC1DBF_PSMC1DBF4_POSN                  equ 0004h
PSMC1DBF_PSMC1DBF4_POSITION              equ 0004h
PSMC1DBF_PSMC1DBF4_SIZE                  equ 0001h
PSMC1DBF_PSMC1DBF4_LENGTH                equ 0001h
PSMC1DBF_PSMC1DBF4_MASK                  equ 0010h
PSMC1DBF_PSMC1DBF5_POSN                  equ 0005h
PSMC1DBF_PSMC1DBF5_POSITION              equ 0005h
PSMC1DBF_PSMC1DBF5_SIZE                  equ 0001h
PSMC1DBF_PSMC1DBF5_LENGTH                equ 0001h
PSMC1DBF_PSMC1DBF5_MASK                  equ 0020h
PSMC1DBF_PSMC1DBF6_POSN                  equ 0006h
PSMC1DBF_PSMC1DBF6_POSITION              equ 0006h
PSMC1DBF_PSMC1DBF6_SIZE                  equ 0001h
PSMC1DBF_PSMC1DBF6_LENGTH                equ 0001h
PSMC1DBF_PSMC1DBF6_MASK                  equ 0040h
PSMC1DBF_PSMC1DBF7_POSN                  equ 0007h
PSMC1DBF_PSMC1DBF7_POSITION              equ 0007h
PSMC1DBF_PSMC1DBF7_SIZE                  equ 0001h
PSMC1DBF_PSMC1DBF7_LENGTH                equ 0001h
PSMC1DBF_PSMC1DBF7_MASK                  equ 0080h

// Register: PSMC1BLKR
#define PSMC1BLKR PSMC1BLKR
PSMC1BLKR                                equ 082Bh
// bitfield definitions
PSMC1BLKR_PSMC1BLKR0_POSN                equ 0000h
PSMC1BLKR_PSMC1BLKR0_POSITION            equ 0000h
PSMC1BLKR_PSMC1BLKR0_SIZE                equ 0001h
PSMC1BLKR_PSMC1BLKR0_LENGTH              equ 0001h
PSMC1BLKR_PSMC1BLKR0_MASK                equ 0001h
PSMC1BLKR_PSMC1BLKR1_POSN                equ 0001h
PSMC1BLKR_PSMC1BLKR1_POSITION            equ 0001h
PSMC1BLKR_PSMC1BLKR1_SIZE                equ 0001h
PSMC1BLKR_PSMC1BLKR1_LENGTH              equ 0001h
PSMC1BLKR_PSMC1BLKR1_MASK                equ 0002h
PSMC1BLKR_PSMC1BLKR2_POSN                equ 0002h
PSMC1BLKR_PSMC1BLKR2_POSITION            equ 0002h
PSMC1BLKR_PSMC1BLKR2_SIZE                equ 0001h
PSMC1BLKR_PSMC1BLKR2_LENGTH              equ 0001h
PSMC1BLKR_PSMC1BLKR2_MASK                equ 0004h
PSMC1BLKR_PSMC1BLKR3_POSN                equ 0003h
PSMC1BLKR_PSMC1BLKR3_POSITION            equ 0003h
PSMC1BLKR_PSMC1BLKR3_SIZE                equ 0001h
PSMC1BLKR_PSMC1BLKR3_LENGTH              equ 0001h
PSMC1BLKR_PSMC1BLKR3_MASK                equ 0008h
PSMC1BLKR_PSMC1BLKR4_POSN                equ 0004h
PSMC1BLKR_PSMC1BLKR4_POSITION            equ 0004h
PSMC1BLKR_PSMC1BLKR4_SIZE                equ 0001h
PSMC1BLKR_PSMC1BLKR4_LENGTH              equ 0001h
PSMC1BLKR_PSMC1BLKR4_MASK                equ 0010h
PSMC1BLKR_PSMC1BLKR5_POSN                equ 0005h
PSMC1BLKR_PSMC1BLKR5_POSITION            equ 0005h
PSMC1BLKR_PSMC1BLKR5_SIZE                equ 0001h
PSMC1BLKR_PSMC1BLKR5_LENGTH              equ 0001h
PSMC1BLKR_PSMC1BLKR5_MASK                equ 0020h
PSMC1BLKR_PSMC1BLKR6_POSN                equ 0006h
PSMC1BLKR_PSMC1BLKR6_POSITION            equ 0006h
PSMC1BLKR_PSMC1BLKR6_SIZE                equ 0001h
PSMC1BLKR_PSMC1BLKR6_LENGTH              equ 0001h
PSMC1BLKR_PSMC1BLKR6_MASK                equ 0040h
PSMC1BLKR_PSMC1BLKR7_POSN                equ 0007h
PSMC1BLKR_PSMC1BLKR7_POSITION            equ 0007h
PSMC1BLKR_PSMC1BLKR7_SIZE                equ 0001h
PSMC1BLKR_PSMC1BLKR7_LENGTH              equ 0001h
PSMC1BLKR_PSMC1BLKR7_MASK                equ 0080h

